def main_menu():
    """
    Обработчик главного меню.
    Отображает отсортированный по имени список из,
    не более чем, 10 контактов.
    Список пронумерован от 0 до 9, где номер
    это выбор определенного контакта.
    Доступные действия:
        - пролистать список вперед, назад;
        - выбрать контакт из списка;
        - найти контакт;
        - добавить контакт;
        - закрыть приложение.
    """


def create_contact():
    """
    Обработчик создания контакта.
    Доступные действия:
        - добавления указанных полей контакта.
        - отмена операции создания контакта.
    """


def edit_contact():
    """
    Обработчик изменения полей контакта.
    Доступные действия:
        - выбрать поле, которое необходимо изменить/добавить;
        - полностью удаленить контакт;
        - отмена операции изменения контакта.
    """


def find_contact():
    """
    Обработчик поиска контакта.
    Доступные действия:
        - указание одного или несколько значений,
        по которым должен произвестись поиск;
        - отмена операции изменения контакта.
    """
